КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/ОД_РассылкаПисемДатаДоставки/ОД_РассылкаПисемДатаДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОД_РассылкаПисемДатаДоставки</name>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/CommonModules/ОД_РассылкаПисем/Module.bsl
#Область ОтправитьПочту

Процедура СброситьФлагАктивности(п_Пользователь)
	
	ЛогСообщить("   - Сброс флаг активности для пользователя: " + п_Пользователь);
	
	НаборЗаписей = РегистрыСведений.ОД_РассылкаПисемДатаДоставки.СоздатьНаборЗаписей();    
	НаборЗаписей.Отбор.Пользователь.Установить(п_Пользователь);
	НаборЗаписей.Прочитать();
	МенеджерЗаписи = РегистрыСведений.ОД_РассылкаПисемДатаДоставки.СоздатьМенеджерЗаписи();
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Активно = Ложь;
		МенеджерЗаписи.Записать();
		ЛогСообщить("      - " + МенеджерЗаписи.ЗаказКлиента);
	КонецЦикла;	
	
КонецПроцедуры

Функция ОтправитьСообщениеПоЭлектроннойПочте(п_ТекстПисьма, АдресЭлектроннойПочты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	EMAILУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("Кому",	АдресЭлектроннойПочты);
	ПараметрыСообщения.Вставить("Тема",	"Изменение даты отгрузки в заказах клиента!!!");
	ПараметрыСообщения.Вставить("Тело",	п_ТекстПисьма);
	
	Попытка
		НовоеПисьмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(EMAILУчетнаяЗапись, ПараметрыСообщения);
		РаботаСПочтовымиСообщениями.ОтправитьПисьмо(EMAILУчетнаяЗапись, НовоеПисьмо);
		ЛогСообщить(" - отправлено письмо: " + АдресЭлектроннойПочты);
		Возврат Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЛогСообщить(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ОтправитьПочту() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЛогСообщить(" - обработка очереди рассылки писем -");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОД_РассылкаПисемДатаДоставки.Пользователь КАК Пользователь,
		|	ОД_РассылкаПисемДатаДоставки.Активно КАК Активно,
		|	ОД_РассылкаПисемДатаДоставки.ЗаказКлиента КАК ЗаказКлиента,
		|	ОД_РассылкаПисемДатаДоставки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ОД_РассылкаПисемДатаДоставки.ДатаСобытия КАК ДатаСобытия,
		|	ОД_РассылкаПисемДатаДоставки.ДатаСтарая КАК ДатаСтарая,
		|	ОД_РассылкаПисемДатаДоставки.ДатаНовая КАК ДатаНовая
		|ИЗ
		|	РегистрСведений.ОД_РассылкаПисемДатаДоставки КАК ОД_РассылкаПисемДатаДоставки
		|ГДЕ
		|	ОД_РассылкаПисемДатаДоставки.Активно
		|ИТОГИ ПО
		|	Пользователь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПользователи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПользователи.Следующий() Цикл

		ТекстПисьма = "";
		Выборка = ВыборкаПользователи.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстПисьма = ТекстПисьма + Выборка.ЗаказКлиента 
				+ ", Дата старая: " + Формат(Выборка.ДатаСтарая, "ДФ=dd.MM.yyyy") 
				+ ", Новая: " +  Формат(Выборка.ДатаНовая, "ДФ=dd.MM.yyyy") + Символы.ПС;
		КонецЦикла;

		Если НЕ ЗначениеЗаполнено(ТекстПисьма) Тогда
			ЛогСообщить(" - текст письма пустой, сообщение отправлено не будет");
			Продолжить;
		КонецЕсли;

		Шапка = "Изменилась дата отгрузки в заказах клиента, по причине смещения даты
			|поступления товара!!! Новые даты отгрузки:";
		
		ТекстПисьма = Шапка + Символы.ПС + Символы.ПС + ТекстПисьма;
		
		ФЛ = ВыборкаПользователи.Пользователь.ФизическоеЛицо;
		Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
			ЛогСообщить("! Пользователь: " + ВыборкаПользователи.Пользователь + " - не заполнено Физическое лицо");
			Продолжить;
		КонецЕсли;
		
		АдресЭП = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФЛ, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		
		Если НЕ ЗначениеЗаполнено(АдресЭП) Тогда
			ЛогСообщить("! Физическое лицо: " + ФЛ + " - не указан e-mail");
			Продолжить;
		КонецЕсли;
		
		Рез = ОтправитьСообщениеПоЭлектроннойПочте(ТекстПисьма, АдресЭП);
		
		Если Рез Тогда
			СброситьФлагАктивности(ВыборкаПользователи.Пользователь);
		КонецЕсли;

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ()

Процедура ЛогСообщить(Знач М)

	ПолноеИмяФайла = "c:\log_1c\Рассылка писем.txt";

	Попытка 
		ЛогФайл = Новый ЗаписьТекста(ПолноеИмяФайла, КодировкаТекста.ANSI,,Истина,);
		ЛогФайл.Записать(Формат(ТекущаяДата(),"ДЛФ=DT")+": " + М + Символы.ПС);
		ЛогФайл.Закрыть();
	Исключение
	Сообщить("ошибка записи лог файла");
	КонецПопытки;

КонецПроцедуры	

#КонецОбласти
